OF_Sims/planar_Sims/planarPoiseuille_4dT/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  8
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-10  0 -1)
    ( 10  0 -1)
    ( 10 10 -1)
    (-10 10 -1)

    (-10  0  1)
    ( 10  0  1)
    ( 10 10  1)
    (-10 10  1)
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (20 10 4) simpleGrading (1 4 1)
);

edges
(
);

boundary
(
    left
    {
        type patch;
        neighbourPatch right;
        faces
        (
            (0 3 7 4)
        );
    }

    right
    {
        type patch;
        neighbourPatch left;
        faces
        (
            (1 2 6 5)
        );
    }

    walls
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    centreline
    {
        type patch;
        faces
        (
            (2 3 7 6)
        );
    }

    frontAndBack
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (4 5 6 7)
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
